***** Backup files
#+begin_src emacs-lisp 
(use-package no-littering)

;; to change the name of the directories used, but doesn't seem to work
;;(setq no-littering-etc-directory
;;      (expand-file-name "config/" user-emacs-directory))
;;(setq no-littering-var-directory
;;      (expand-file-name "data/" user-emacs-directory))

;; auto save files
(setq auto-save-file-name-transforms
      `((".*" ,(no-littering-expand-var-file-name "auto-save/") t)))

;; customisation
(setq custom-file (expand-file-name "custom.el" user-emacs-directory))
;; or
;; (setq custom-file (no-littering-expand-etc-file-name "custom.el"))

#+end_src

#+RESULTS:
: /home/mehdif/.emacs.d/custom.el


**** Electric indent off
  #+begin_src emacs-lisp 
  (setq electric-indent-mode nil)
  #+end_src

  #+RESULTS:
  : -1
***** lsp
 #+begin_src emacs-lisp 
    (use-package lsp-mode
      :commands (lsp lsp-deferred)
      :hook (lsp-mode . lkr/lsp-mode-setup)
      :init
      (setq lsp-keymap-prefix "C-c l") ;; or C-l
      :config
      (add-hook 'c++-mode-hook #'lsp-deferred) 
      (add-hook 'python-mode-hook #'lsp-deferred) 
      ;; It tells clangd that it can use 4 concurrent jobs and to make a complete background index on disk.
      (setq lsp-clients-clangd-args '("-j=4" "-background-index" "-log=error"))
      (lsp-enable-which-key-integration t))

  #+end_src

  #+RESULTS:
  | company-mode | lsp-ui-mode | lkr/lsp-mode-setup |

**** Python
  python:
  #+begin_src emacs-lisp 
   (use-package python-mode
     :ensure nil
     :hook (python-mode . lsp-deferred)
     ;(python-shell-interpreter "python3") ;; if you need to change the interpreter
  )
  #+end_src

  #+RESULTS:
  | lsp-deferred | doom-modeline-env-setup-python |

**** rainbow delimiters
#+begin_src emacs-lisp 
(use-package rainbow-delimiters
  :hook (prog-mode . rainbow-delimiters-mode)
        (TeX-mode . rainbow-delimiters-mode))
#+end_src

#+RESULTS:
| rainbow-delimiters-mode |

**** projectile
#+begin_src emacs-lisp 
(use-package projectile 
  :diminish projectile-mode
  :config (projectile-mode)
  :after lsp-mode
  :custom ((projectile-completion-system 'ivy))
  :bind-keymap 
  ("C-c p" . projectile-command-map)
  :init
  (when (file-directory-p "~/Documents/projets/code")
    (setq projectile-project-search-path '("~/Projects/Code")))
;; where do projectile will search projects (git repo and other)
  
(setq projectile-switch-project-action #'projectile-dired))
;; what to do when you switch projects (in this case, open dired) 
#+end_src

#+RESULTS:
| lambda | nil | (interactive) | (use-package-autoload-keymap 'projectile-command-map 'projectile nil) |

****** Code blocks templates
 #+begin_src emacs-lisp
 ;(require 'org-tempo) ; if you want to enable <s for instance

 ; C-q C-j to put the space after python
 (add-to-list 'org-structure-template-alist 
    '("p" . "src python :results output
 "))
 (add-to-list 'org-structure-template-alist 
    '("m" . "src emacs-lisp 
 "))

 #+end_src

 #+RESULTS:
 : ((m . src emacs-lisp 
 : ) (p . src python :results output
 : ) (a . export ascii) (c . center) (C . comment) (e . example) (E . export) (h . export html) (l . export latex) (q . quote) (s . src) (v . verse))

**** use-package org

 #+begin_src emacs-lisp 
(setq org-startup-folded t) ;; outside of defun because it didn't do it before opening a file

 (use-package org
   :hook (org-mode . lkr/org-mode-config)
   :commands (org-capture org-agenda)
   :config
   )
 #+end_src

 #+RESULTS:
 | turn-on-auto-fill | (lambda nil (display-line-numbers-mode 0)) | lkr/org-mode-config | (lambda nil (org-bullets-mode 1)) | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-show-all append local] 5] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes |

**** org export setup
from [[https://www.youtube.com/watch?v=0qHloGTT8XE&t=11s][youtube video]]
here we create our own class, which will only include package we need,
and not additional things set by org export.

To include the bare minimum packages, we will use a setup file.
So don't forget to put
#+begin_example
#+SETUPFILE: ~/Dropbox/Mackup/emacs-stuff/org/jake-standard-latex-export.org
#+end_example

in the beginning of your org file

#+begin_src emacs-lisp 
(with-eval-after-load 'ox-latex
(add-to-list 'org-latex-classes
             '("org-plain-latex"
               "\\documentclass{article}
           [NO-DEFAULT-PACKAGES]
           [PACKAGES]
           [EXTRA]"
               ("\\section{%s}" . "\\section*{%s}")
               ("\\subsection{%s}" . "\\subsection*{%s}")
               ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
               ("\\paragraph{%s}" . "\\paragraph*{%s}")
               ("\\subparagraph{%s}" . "\\subparagraph*{%s}"))))

#+end_src

#+RESULTS:
| org-plain-latex | \documentclass{article} |

***** pdftools integration
 inspired by [[https://emacs.stackexchange.com/questions/19686/how-to-use-pdf-tools-pdf-view-mode-in-emacs][use pdf view in orgmode]]
 and using [[https://github.com/fuxialexander/org-pdftools][org-pdftools]] instead

 #+begin_src emacs-lisp 
 (use-package org-pdftools
   :hook (org-mode . org-pdftools-setup-link))

 (add-to-list 'org-file-apps 
              '("\\.pdf\\'" . (lambda (file link)
                                      (org-pdftools-open link))))
 #+end_src

 #+RESULTS:
 : ((\.pdf\' lambda (file link) (org-pdftools-open link)) (auto-mode . emacs) (directory . emacs) (\.mm\' . default) (\.x?html?\' . default) (\.pdf\' . default))

**** Change frame name of emacs:                                   :LUKA:WEB:
 #+begin_src emacs-lisp 
 (setq frame-title-format
  '("Emacs - " (buffer-file-name "%f"
     (dired-directory dired-directory "%b"))))
 #+end_src

 #+RESULTS:
 | Emacs - | (buffer-file-name %f (dired-directory dired-directory %b)) |

****** Org-mode

 #+begin_src emacs-lisp 
 ; Rough navigation
 (with-eval-after-load 'org
 (ryo-modal-major-mode-keys
 'org-mode

  ("o" :hydra
     '(hydra-org-rough-navigation_1 ()
    ; "A hydra to navigate through sentences and words."
 "Chunks navigation"
              ("M-d" org-backward-paragraph "backward paragraph")
              ("M-s" org-forward-paragraph "forward paragraph")
	      ("M-t" org-backward-sentence "backward sentence")
              ("M-r" org-forward-sentence "forward sentence")
	      ("r" forward-word "forward word")
	      ("t" backward-word "backward word")
	      ))
  ("e" :hydra
     '(hydra-org-rough-navigation_2 ()
    ; "A hydra to navigate through headers, move them if necessary."
 "Big chunks navigation"

              ("d" org-previous-visible-heading "org-previous-visible-heading")
              ("s" org-next-visible-heading "org-next-visible-heading")
	      ("p" org-cycle "org-cycle")
	      ("M-p" org-babel-execute-src-block "execute-src-block")
              ("M-d" org-babel-previous-src-block  "previous-src-block")	     
              ("M-s" org-babel-next-src-block  "next-src-block")	     

	      ))
	      )
 )
 #+end_src

 #+RESULTS:
 | o   | hydra-org-rough-navigation_1/body       | :mode              | org-mode      |          |
 | '   | hydra-buffer/body                       |                    |               |          |
 | u   | org-hydra-yank/body                     | :then              | (org-yank)    |          |
 | M-S | org-shiftmetadown                       | org-shiftmetadown  | :mode         | org-mode |
 | M-D | org-shiftmetaup                         | org-shiftmetaup    | :mode         | org-mode |
 | M-T | org-shiftmetaleft                       | org-shiftmetaleft  | :mode         | org-mode |
 | M-R | org-shiftmetaright                      | org-shiftmetaright | :mode         | org-mode |
 | M-s | org-metadown                            | org-metadown       | :mode         | org-mode |
 | M-d | org-metaup                              | org-metaup         | :mode         | org-mode |
 | M-t | org-metaleft                            | org-metaleft       | :mode         | org-mode |
 | M-r | org-metaright                           | org-metaright      | :mode         | org-mode |
 | C-i | org-insert-heading-respect-content      | :mode              | org-mode      |          |
 | i   | org-return                              | :mode              | org-mode      |          |
 | M-i | org-kill-line                           | :mode              | org-mode      |          |
 | a   | org-delete-backward-char                | :mode              | org-mode      |          |
 | u   | hydra-yank/body                         | :then              | (yank)        |          |
 | M-é | kill-region                             |                    |               |          |
 | M-u | undo-tree-redo                          |                    |               |          |
 | M-a | undo-tree-undo                          |                    |               |          |
 | M-i | kill-line                               |                    |               |          |
 | i   | newline                                 |                    |               |          |
 | a   | delete-backward-char                    |                    |               |          |
 | é   | kill-ring-save                          |                    |               |          |
 | p   | set-mark-command                        |                    |               |          |
 | b   | ryo-modal-mode                          |                    |               |          |
 | u   | pdf-view-shrink                         | :mode              | pdf-view-mode |          |
 | é   | pdf-view-enlarge                        | :mode              | pdf-view-mode |          |
 | M-S | pdf-view-last-page                      | :mode              | pdf-view-mode |          |
 | M-D | pdf-view-first-page                     | :mode              | pdf-view-mode |          |
 | M-s | image-eob                               | :mode              | pdf-view-mode |          |
 | M-d | image-bob                               | :mode              | pdf-view-mode |          |
 | t   | image-backward-hscroll                  | :mode              | pdf-view-mode |          |
 | r   | image-forward-hscroll                   | :mode              | pdf-view-mode |          |
 | d   | pdf-view-previous-line-or-previous-page | :mode              | pdf-view-mode |          |
 | s   | pdf-view-next-line-or-next-page         | :mode              | pdf-view-mode |          |
 | M-t | pdf-view-previous-page-command          | :mode              | pdf-view-mode |          |
 | M-r | pdf-view-next-page-command              | :mode              | pdf-view-mode |          |
 | e   | hydra-org-rough-navigation_2/body       | :mode              | org-mode      |          |
 | x   | hydra-org-rough-navigation_1/body       | :mode              | org-mode      |          |
 | x   | hydra-rough-navigation/body             |                    |               |          |
 | n   | end-of-line                             |                    |               |          |
 | c   | beginning-of-line                       |                    |               |          |
 | r   | forward-char                            |                    |               |          |
 | d   | previous-line                           |                    |               |          |
 | s   | next-line                               |                    |               |          |
 | t   | backward-char                           |                    |               |          |

